# Analyze bookstore sales with Python

My mission here for Lapage is to analyse the strengths, weaknesses and customer behavior of Lapage.

I was also asked to ...
 <br></br>
 
<u> Summary</u> :

 Tools

 I. Explore and clean <a href="https://github.com/donia-nefiz/Analyze-bookstore-sales-with-Python" target="_blank">Lapage data</a>
     <br>*1. [customers.csv](http://localhost:8888/edit/customers.csv) : exploration and data cleaning [(here)](#another_cell_a)*</br>
     <br>*2. [products.csv](http://localhost:8888/edit/products.csv) : exploration and data cleaning [(here)](#another_cell_b)*</br>
     <br>*3. [transactions.csv](http://localhost:8888/edit/transactions.csv) : exploration and data cleaning [(here)](#another_cell_c)*</br>
     <br>*4. ...
         <br>*-- a. .... [(here)](#another_cell_d)</br>*
         <br>*-- b. ... [(here)](#another_cell_e)</br>*
          <br>*--c. ... [(here)](#another_cell_f)</br>*


II. ...
    <br>1. ...</br>
    <br>*-- a. ... [(here)](#another_cell_g)</br>*
    <br>*-- b. ... [(here)](#another_cell_h)</br>*
    <br>2. ...</br>
    <br>*-- a. ... [(here)](#another_cell_i)</br>*
    <br>*-- b. ... [(here)](#another_cell_j)</br>*
<br></br>

## I. Lapage data, files exploration and data cleaning

### Tools

In [68]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import datetime as dt
import seaborn as sns
import warnings

In [71]:
#Check null values function :
def check_nan(data, column):
    if len(data[data[column].isnull()]) == 0:
        print ("The column", column, "does not contain any missing values")
    else :
        print("The column", column, "contain ", len(data[data[column].isnull()]), " missing values")

In [79]:
#Check duplicates function :
def check_duplicates(data, column):
    n = len(data.index)
    if len(data[column].drop_duplicates()) == n :
        print ("The column", column, "does not contain duplicates")
    else :
        print("The column", column, "contains ", len(data[data[column].duplicated()]), " duplicates.")
        return data[data[column].duplicated()]

In [74]:
# Check outliers function :
outliers=[]
def check_outliers(data):
    threshold = 2
    mean = np.mean(data)
    std = np.std(data)
    
    for i in data:
        z_score = (i- mean)/std
        if z_score > threshold:
            outliers.append(i)
    print("The number of outliers detected is about  " + str(len(outliers)))

### 1. [customers.csv](http://localhost:8888/edit/customers.csv) : exploration and data cleaning

- Loading file:

In [69]:
customers = pd.read_csv('customers.csv', sep=';')

- First 5 rows display :

In [4]:
customers.head()

  client_id sex  birth
0    c_4410   f   1967
1    c_7839   f   1975
2    c_1699   f   1984
3    c_5961   f   1962
4    c_5320   m   1943

- Number of rows and columns :

In [5]:
customers.shape

(8623, 3)

- .info display :

In [16]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8623 entries, 0 to 8622
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  8623 non-null   object
 1   sex        8623 non-null   object
 2   birth      8623 non-null   int64
dtypes: int64(1), object(2)
memory usage: 202.2+ KB

- Check null and duplicates values :

In [81]:
check_nan(customers, "client_id")
check_duplicates(customers, "client_id")

The column client_id does not contain any missing values
The column client_id does not contain duplicates

 <a id='another_cell_b'></a>

### 2. [products.csv](http://localhost:8888/edit/products.csv) : exploration and data cleaning*

- Loading file:

In [12]:
products = pd.read_csv('products.csv', sep=';')

- First 5 rows display :

In [13]:
products.head()

  id_prod  price  categ
0  0_1421  19.99      0
1  0_1368   5.13      0
2   0_731  17.99      0
3   1_587   4.99      1
4  0_1507   3.99      0

- Number of rows and columns :

In [25]:
products.shape

(3287, 3)

- .info display :

In [15]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3287 entries, 0 to 3286
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id_prod  3287 non-null   object
 1   price    3287 non-null   float64
 2   categ    3287 non-null   int64
dtypes: float64(1), int64(1), object(1)
memory usage: 77.2+ KB

- .sort_values display on price and drop value in error :

In [23]:
products.sort_values(by=['price'])

     id_prod   price  categ
731      T_0   -1.00      0
2355   0_202    0.62      0
2272   0_528    0.62      0
370    0_120    0.66      0
1211  0_1844    0.77      0
...      ...     ...    ...
2779    2_30  233.54      2
1436   2_167  236.99      2
394    2_158  247.22      2
724     2_76  254.44      2
947      2_2  300.00      2

[3287 rows x 3 columns]

In [26]:
products = products.drop([731]).reset_index(drop=True)

- Check new df 'products' :

In [27]:
products.sort_values(by=['price'])

     id_prod   price  categ
2271   0_528    0.62      0
2354   0_202    0.62      0
370    0_120    0.66      0
1210  0_1844    0.77      0
1529  0_1620    0.80      0
...      ...     ...    ...
2778    2_30  233.54      2
1435   2_167  236.99      2
394    2_158  247.22      2
724     2_76  254.44      2
946      2_2  300.00      2

[3286 rows x 3 columns]

  <a id='another_cell_c'></a>

### 3. [transactions.csv](http://localhost:8888/edit/transactions.csv) : exploration and data cleaning

- Loading file:

In [44]:
transactions = pd.read_csv('transactions.csv', sep=';')

- First 5 rows display :

In [52]:
transactions.head()

  id_prod     date session_id client_id
0  0_1518  21:29.0   s_211425     c_103
1   1_251  55:19.1   s_158752    c_8534
2  0_1277  44:33.2   s_225667    c_6714
3   2_209  19:29.8    s_52962    c_6941
4  0_1509  22:08.2   s_325227    c_4232

- Number of rows and columns :

In [46]:
transactions.shape

(679532, 4)

- .info display :

In [51]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 679532 entries, 0 to 679531
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   id_prod     679532 non-null  object
 1   date        679532 non-null  object
 2   session_id  679532 non-null  object
 3   client_id   679532 non-null  object
dtypes: object(4)
memory usage: 20.7+ MB

In [67]:
import datetime as dt
transactions['date'] = transactions['date'].to_datetime(format="%m/%d/%Y)

SyntaxError: EOL while scanning string literal (<ipython-input-67-de46db2742d3>, line 2)

 <a id='another_cell_d'></a>

### 4. ...

 <a id='another_cell_d'></a>

#### a. ...

- "left_only" analysis :

- "sku" dropna :

- Check df null values :

 <a id='another_cell_e'></a>

#### b. ...

- "left_only" analysis :

- "sku" dropna :

- "_merge" column drop :

 <a id='another_cell_f'></a>

#### c. ...

- Useless "sku_y" column drop :

- "sku_x" column renamed :

- "post_title" column dropna to delete the latest nan values :

- Drop duplicates on "post_title" and "price" columns :

- Check null values and drop empty and useless columns :

## 2. ...

### 1. ...

 <a id='another_cell_g'></a>

#### a. ...

 <a id='another_cell_h'></a>

#### b. ...

### 2. ...

 <a id='another_cell_i'></a>

#### a. ...

 <a id='another_cell_j'></a>

#### b. ...